
#Область ПрограммныйИнтерфейс

// Отправляет уведомления в группу в Телеграм
Процедура ОтправитьУведомлениеВТелеграм() Экспорт
	
	ДанныеДляОтправкиИУдаления = ДанныеДляОтправкиИУдаления();
	
	Если ДанныеДляОтправкиИУдаления = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет уведомлений для отправки");
		Возврат;
	КонецЕсли;
	
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппыТелеграм = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение("api.telegram.org", , , , , , ЗащищенноеСоединение);
	
	Для Каждого Сообщение Из ДанныеДляОтправкиИУдаления.СписокСообщений Цикл
		
		АдресРесурса = СтрШаблон("/bot%1/SendMessagе?chat_id=%2&text=%3", Токен, ИдентификаторГруппыТелеграм, Сообщение);
	
		Запрос = Новый HTTPЗапрос(АдресРесурса);

		Попытка
			Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	
		Если Ответ.КодСостояния = 200 Тогда 
			Справочники.ВКМ_УведомленияТелеграмБоту.УдалитьУведомления(ДанныеДляОтправкиИУдаления.СписокСсылок);
		Иначе
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
			ОбщегоНазначения.СообщитьПользователю(ТелоОтвета);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляОтправкиИУдаления()
	
	Данные = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	НЕ ВКМ_УведомленияТелеграмБоту.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Данные;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Данные = Новый Структура("СписокСсылок, СписокСообщений");
	СписокСсылок = Новый Массив;
	СписокСообщений = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СписокСсылок.Добавить(Выборка.Ссылка);
		СписокСообщений.Добавить(Выборка.ТекстСообщения);
	КонецЦикла;
	
	Данные.СписокСсылок = СписокСсылок;
	Данные.СписокСообщений = СписокСообщений;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти