
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Помечает на удаление элементы справочника
// 
// Параметры:
// 
// Ссылки - Массив из СправочникСсылка - Список ссылок на элементы справочника для пометки на удаление
Процедура УдалитьУведомления(Ссылки) Экспорт
	
	Для Каждого Ссылка Из Ссылки Цикл
		
		ЭлементОбъект = Ссылка.ПолучитьОбъект();
		ЭлементОбъект.ПометкаУдаления = Истина;
		ЭлементОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Создает элемент справочника и заполняет реквизит ТекстСообщения
//
// Параметры:
// 
// ТекстСообщенияСпециалисту - Строка - Сообщение для отправки уведомления в группу телеграм
Процедура СоздатьУведомлениеТелеграмБоту(ТекстСообщенияСпециалисту) Экспорт
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.ТекстСообщения = ТекстСообщенияСпециалисту;
	НовыйЭлемент.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
