
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Дата
		|			МЕЖДУ ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_НачалоДействияДоговора И ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_ОкончаниеДействияДоговора
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДатаДокументаВПериодеДоговора,
		|	ВЫБОР
		|		КОГДА
		|			ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДоговорАбонентскогоОбслуживания,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.ДоговорАбонентскогоОбслуживания Тогда
			ОбщегоНазначения.СообщитьПользователю("Выберите договор абонентского обслуживания",, "Объект.Договор");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Не Выборка.ДатаДокументаВПериодеДоговора Тогда
			ОбщегоНазначения.СообщитьПользователю("Период действия договора не подходит для документа",, "Объект.Договор");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = Выборка.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = Выборка.СтоимостьЧасаРаботы * Выборка.ЧасыКОплатеКлиенту;

	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		СпециалистНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Специалист,"Наименование");
			
		ТекстСообщенияСпециалисту = СтрШаблон("Заявка на работу специалиста: %1. Плановая дата и время проведения работ: %2 с %3 по %4.",
			СпециалистНаименование,
			Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"),
			Формат(ВремяНачалаРабот, "ДФ=ЧЧ:мм;"),
			Формат(ВремяОкончанияРабот, "ДФ=ЧЧ:мм;"));
			
		Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьУведомлениеТелеграмБоту(ТекстСообщенияСпециалисту);
		
	Иначе
		
		ПроверяемыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Специалист,ДатаПроведенияРабот,ВремяНачалаРабот,ВремяОкончанияРабот");
		
		Если ПроверяемыеРеквизиты.Специалист <>	Специалист 
		Или ПроверяемыеРеквизиты.ДатаПроведенияРабот <> ДатаПроведенияРабот
		Или ПроверяемыеРеквизиты.ВремяНачалаРабот <> ВремяНачалаРабот
		Или ПроверяемыеРеквизиты.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
				
			СпециалистНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Специалист,"Наименование");
			ТекстСообщенияСпециалисту = СтрШаблон("Изменена заявка №%1. Специалист: %2. Плановая дата и время проведения работ: %3 с %4 по %5",
				ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер),
				СпециалистНаименование,
				Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"),
				Формат(ВремяНачалаРабот, "ДФ=ЧЧ:мм;"),
				Формат(ВремяОкончанияРабот, "ДФ=ЧЧ:мм;"));	
				
			Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьУведомлениеТелеграмБоту(ТекстСообщенияСпециалисту);	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли