#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
		
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда 
		ДобавитьГруппаПериодДействияДоговора(Форма);
		ДобавитьПолеНачалоДействияДоговораВГруппаПериодДействияДоговора(Форма);
		ДобавитьПолеОкончаниеДействияДоговораВГруппаПериодДействияДоговора(Форма);
		ДобавитьПолеАбонентскаяПлата(Форма);
		ДобавитьПолеСтоимостьЧасаРаботы(Форма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьГруппаПериодДействияДоговора(Форма)
	
	ГруппаПериодДействияДоговора = Форма.Элементы.Вставить("ГруппаПериодДействияДоговора", Тип("ГруппаФормы"));
	ГруппаПериодДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействияДоговора.ОтображатьЗаголовок = Ложь;
	ГруппаПериодДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
КонецПроцедуры

Процедура ДобавитьПолеНачалоДействияДоговораВГруппаПериодДействияДоговора(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействияДоговора);
	ПолеВвода.Подсказка = "Дата начала действия договора";
	ПолеВвода.Заголовок = "Период действия с";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	
КонецПроцедуры

Процедура ДобавитьПолеОкончаниеДействияДоговораВГруппаПериодДействияДоговора(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействияДоговора);
	ПолеВвода.Подсказка = "Дата окончания действия договора";
	ПолеВвода.Заголовок = "по";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
	
КонецПроцедуры

Процедура ДобавитьПолеАбонентскаяПлата(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("АбонентскаяПлата", Тип("ПолеФормы"));
	ПолеВвода.Подсказка = "Сумма ежемесячной абоненсткой платы";
	ПолеВвода.Заголовок = "Абонентская плата";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
КонецПроцедуры

Процедура ДобавитьПолеСтоимостьЧасаРаботы(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВвода.Подсказка = "Стоимость часа работы специалиста";
	ПолеВвода.Заголовок = "Стоимость часа работы";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры


#КонецОбласти