
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Объект.Год = НачалоГода(Объект.Год);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодсчетДнейОтпуска(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодсчетДнейОтпуска(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодсчетДнейОтпуска(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Диаграмма(Команда)
	
	Если Объект.ОтпускаСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокОтпусковСотрудников = Новый Массив;
	СписокОтпусковИГод = Новый Структура("СписокОтпусковСотрудников, Год", СписокОтпусковСотрудников, Объект.Год);
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		СтруктураДанных = Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания");
		СтруктураДанных.Сотрудник = Строка.Сотрудник;
		СтруктураДанных.ДатаНачала = Строка.ДатаНачала;
		СтруктураДанных.ДатаОкончания = Строка.ДатаОкончания;
		СписокОтпусковСотрудников.Добавить(СтруктураДанных);
	КонецЦикла;
	
	АдресДанных = ПоместитьВоВременноеХранилище(СписокОтпусковИГод);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресДанных);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодсчетДнейОтпуска(Строка)
	
	Если Не ЗначениеЗаполнено(Строка.Сотрудник)
	Или Не ЗначениеЗаполнено(Строка.ДатаНачала)
	Или Не ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	Строка.ДнейОтпуска = 0;
	
	Отбор = Новый Структура("Сотрудник", Строка.Сотрудник);
	
	СписокСтрокСотрудника = Объект.ОтпускаСотрудников.НайтиСтроки(Отбор);
	
	ВсегоДнейОтпуска = 0;
	
	Для Каждого СтрокаТЧ Из СписокСтрокСотрудника Цикл
		ВсегоДнейОтпуска = ВсегоДнейОтпуска + Цел(((СтрокаТЧ.ДатаОкончания + 86400) - СтрокаТЧ.ДатаНачала) / 86400);
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из СписокСтрокСотрудника Цикл
		СтрокаТЧ.ДнейОтпуска = ВсегоДнейОтпуска;
	КонецЦикла;
	
	Если ВсегоДнейОтпуска > 28 Тогда
		ТекстСообщения = СтрШаблон("Общее количество дней отпуска для сотрудника %1 превышает 28", Строка.Сотрудник);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
