
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ЗаполнитьДоговорыИРеализации(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Основание,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор
		|ПОМЕСТИТЬ ВТ_Основание
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ВКМ_ОбслуживаниеКлиента.Клиент = ЗаказПокупателя.Контрагент
		|		И ВКМ_ОбслуживаниеКлиента.Договор = ЗаказПокупателя.Договор
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Основание.Основание КАК Основание,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации"") КАК Реализация,
		|	ВТ_Основание.Договор КАК Договор
		|ИЗ
		|	ВТ_Основание КАК ВТ_Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВТ_Основание.Основание = РеализацияТоваровУслуг.Основание";
		
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(КонецМесяца(Дата)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДоговорыИРеализации = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Реализация) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументОбъект.Дата = КонецМесяца(Дата);
			ДокументОбъект.Заполнить(Выборка.Основание);
			ДокументОбъект.ВыполнитьАвтозаполнение();
			
			Если ДокументОбъект.ПроверитьЗаполнение() Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
				
			Данные = Новый Структура("Договор, Реализация");
			Данные.Договор = Выборка.Договор;
			Данные.Реализация = ДокументОбъект.Ссылка;
			ДоговорыИРеализации.Добавить(Данные);
			
		Иначе
			
			Данные = Новый Структура("Договор, Реализация");
			Данные.Договор = Выборка.Договор;
			Данные.Реализация = Выборка.Реализация;
			ДоговорыИРеализации.Добавить(Данные);
			
		КонецЕсли;
					
	КонецЦикла;
	
	Возврат ДоговорыИРеализации;
	
КонецФункции

#КонецОбласти

#КонецЕсли