
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ЗаполнитьДоговорыИРеализации(Дата) Экспорт
	
	ДоговорыИРеализации = Новый Массив;
	
	СозданиеДокументовРеализации(Дата, ДоговорыИРеализации);
	
	УчетНеоконченныхРаботПоДоговору(Дата, ДоговорыИРеализации);
	
	Возврат ДоговорыИРеализации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СозданиеДокументовРеализации(Дата, ДоговорыИРеализации)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации"") КАК Реализация,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ВКМ_ОбслуживаниеКлиента.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.Договор,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации""),
		|	ВКМ_ОбслуживаниеКлиента.Клиент";
		
	Запрос.УстановитьПараметр("НачалоМесяца", Дата);
	Запрос.УстановитьПараметр("КонецМесяца", КонецДня(КонецМесяца(Дата)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Реализация) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			ДанныеЗаполнения = Новый Структура("Дата, Договор, Клиент", КонецМесяца(Дата), Выборка.Договор, Выборка.Клиент);
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			ДокументОбъект.ВыполнитьАвтозаполнение();
			Если ДокументОбъект.ПроверитьЗаполнение() Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
				
			Данные = Новый Структура("Договор, Реализация", Выборка.Договор, ДокументОбъект.Ссылка);
			ДоговорыИРеализации.Добавить(Данные);
			
		Иначе
			
			Данные = Новый Структура("Договор, Реализация", Выборка.Договор, Выборка.Реализация);
			ДоговорыИРеализации.Добавить(Данные);
			
		КонецЕсли;
					
	КонецЦикла;
	
КонецПроцедуры

Процедура УчетНеоконченныхРаботПоДоговору(Дата, ДоговорыИРеализации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации"") КАК Реализация,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор.Представление КАК ДоговорПредставление,
		|	ВКМ_ОбслуживаниеКлиента.Представление КАК ОбслуживаниеПредставление
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И НЕ ВКМ_ОбслуживаниеКлиента.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.Договор,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации""),
		|	ВКМ_ОбслуживаниеКлиента.Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор.Представление,
		|	ВКМ_ОбслуживаниеКлиента.Представление";
	
	Запрос.УстановитьПараметр("НачалоМесяца", Дата);
	Запрос.УстановитьПараметр("КонецМесяца", КонецДня(КонецМесяца(Дата)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	ТекстКомментария = СтрШаблон("Не завершены работы по обслуживанию клиента по договору: %1
		|Документ обслуживания: %2
		|После завершения работ стоит перезаполнить таблицу Услуги и провести документ", 
			Выборка.ДоговорПредставление, 
			Выборка.ОбслуживаниеПредставление);
		
		Если ТипЗнч(Выборка.Реализация) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			ДанныеЗаполнения = Новый Структура("Дата, Договор, Клиент", КонецМесяца(Дата), Выборка.Договор, Выборка.Клиент);
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
			ДокументОбъект.Комментарий = ТекстКомментария;
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Данные = Новый Структура("Договор, Реализация", Выборка.Договор, ДокументОбъект.Ссылка);
			ДоговорыИРеализации.Добавить(Данные);
			
		Иначе
			
			ДокументОбъект = Выборка.Реализация.ПолучитьОбъект();
			ДокументОбъект.Комментарий = ТекстКомментария;
		
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли