#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НачислениеПремии();
	РасчетНДФЛ();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачислениеПремии()
	
	Для Каждого Строка Из СписокСотрудников Цикл	
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Результат = Строка.СуммаПремии;
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура РасчетНДФЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_Удержания.Регистратор КАК Регистратор,
		|	ВКМ_Удержания.Размер КАК Размер,
		|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_СписокСотрудников
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник = ВКМ_Удержания.Сотрудник
		|ГДЕ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Ссылка = &Ссылка
		|	И ВКМ_Удержания.ВидРасчета = &НДФЛ
		|	И ВКМ_Удержания.ПериодРегистрации = &ПериодРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокСотрудников.Сотрудник КАК Сотрудник,
		|	ВТ_СписокСотрудников.Регистратор КАК Регистратор,
		|	ВТ_СписокСотрудников.Размер КАК Размер,
		|	ВТ_СписокСотрудников.НомерСтроки КАК НомерСтроки,
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза КАК ОсновныеНачисления
		|ПОМЕСТИТЬ ВТ_ОсновныеНачисления
		|ИЗ
		|	ВТ_СписокСотрудников КАК ВТ_СписокСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,, (Сотрудник,
		|			Регистратор) В
		|			(ВЫБРАТЬ
		|				СписокСотрудников.Сотрудник КАК сотрудник,
		|				СписокСотрудников.Регистратор КАК Регистратор
		|			ИЗ
		|				Вт_СписокСотрудников КАК СписокСотрудников)
		|		И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
		|		ПО ВТ_СписокСотрудников.Сотрудник = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Сотрудник
		|		И ВТ_СписокСотрудников.Регистратор = ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВТ_ОсновныеНачисления.Регистратор КАК Регистратор,
		|	ВТ_ОсновныеНачисления.Размер КАК Размер,
		|	ВТ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВТ_ОсновныеНачисления.ОсновныеНачисления КАК ОсновныеНачисления,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК ДополнительныеНачисления
		|ИЗ
		|	ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,, Сотрудник В
		|			(ВЫБРАТЬ
		|				СписокСотрудников.Сотрудник КАК сотрудник
		|			ИЗ
		|				Вт_СписокСотрудников КАК СписокСотрудников)
		|		И ВидРасчета = &НДФЛ
		|		И ПериодРегистрации = &ПериодРегистрации) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
		|		ПО ВТ_ОсновныеНачисления.Сотрудник = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		// набор записей регистра расчета Удержания
		НаборЗаписейУдержания = РегистрыРасчета.ВКМ_Удержания.СоздатьНаборЗаписей();
		НаборЗаписейУдержания.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписейУдержания.Прочитать();
		
		// набор записей регистра накопления ВзаиморасчетыССотрудниками
		НаборЗаписейВзаиморасчеты = РегистрыНакопления.ВКМ_ВзаиморасчетыССотрудниками.СоздатьНаборЗаписей();
		НаборЗаписейВзаиморасчеты.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписейВзаиморасчеты.Прочитать();
		
	КонецЕсли;
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Запись Из НаборЗаписейУдержания Цикл
			Если Выборка.НомерСтроки = Запись.НомерСтроки Тогда
				Запись.Результат = (Выборка.ОсновныеНачисления + Выборка.ДополнительныеНачисления) * (Выборка.Размер / 100);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Запись Из НаборЗаписейВзаиморасчеты Цикл
			Если Выборка.Сотрудник = Запись.Сотрудник Тогда
				Удержание = (Выборка.ОсновныеНачисления + Выборка.ДополнительныеНачисления) * (Выборка.Размер / 100);
				Запись.Сумма = Выборка.ОсновныеНачисления + Выборка.ДополнительныеНачисления - Удержание;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписейУдержания.Записать(, Истина);
	НаборЗаписейВзаиморасчеты.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли