
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.АдресДанных) Тогда
		Возврат;
	КонецЕсли;
	
	СписокОтпусковИГод = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
	
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.УстановитьПолныйИнтервал(СписокОтпусковИГод.Год, КонецГода(СписокОтпусковИГод.Год));
	Диаграмма.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Квартал;
	Диаграмма.КратностьПериодическогоВарианта = 1;
	
	Для Каждого Строка Из СписокОтпусковИГод.СписокОтпусковСотрудников Цикл
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		//@skip-check bsl-legacy-check-string-literal
		Точка.Текст = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Сотрудник, "Представление");
		
		Серия = Диаграмма.УстановитьСерию("Отпуск");
		Серия.Текст = "Отпуск";
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		Интервал.Текст = СтрШаблон("с %1 по %2", Формат(Интервал.Начало, "ДФ=dd.MM.yy;"), Формат(Интервал.Конец, "ДФ=dd.MM.yy;"));
		Интервал.ЦветТекста = WebЦвета.Желтый;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
