
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГрафикПриИзменении(Элемент)
	
	ИзменениеФлагаДанныеСайта();
	 
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСайтаПриИзменении(Элемент)
	ИзменениеФлагаДанныеСайта();
	Элементы.ВыходныеДни.Доступность = Не ДанныеСайта;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите период",, "Период");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(График) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите график",, "График");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменениеФлагаДанныеСайта()
	
	Если Не График = ПредопределенноеЗначение("Справочник.ВКМ_ГрафикиРаботы.Пятидневка") 
	И Не График = ПредопределенноеЗначение("Справочник.ВКМ_ГрафикиРаботы.Шестидневка")
	И ДанныеСайта Тогда
		ДанныеСайта = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Данные с сайта isdayoff.ru могут быть получены только для пятидневной или шестидневной рабочей недели");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьНаСервере(Период.ДатаНачала, Период.ДатаОкончания, ВыходныеДни, График, ДанныеСайта);
	
КонецПроцедуры

#КонецОбласти
