
&НаКлиенте
Процедура ДанныеСайтаПриИзменении(Элемент)
	Элементы.ВыходныеДни.Доступность = Не ДанныеСайта;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите период",, "Период");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(График) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите график",, "График");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьНаСервере(Период.ДатаНачала, Период.ДатаОкончания, ВыходныеДни, График, ДанныеСайта);
	
КонецПроцедуры