#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//{{ Коробов П.В. "Договоры на абонентское обслуживание"
	ВКМ_РаботаСФормами.ДополнитьФорму(ЭтотОбъект);
	
	АбонентскоеОбслуживаниеВидимостьЭлементов();
	//}} Коробов П.В. "Договоры на абонентское обслуживание"
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	//{{ Коробов П.В. "Договоры на абонентское обслуживание"
	АбонентскоеОбслуживаниеВидимостьЭлементов();
	//}} Коробов П.В. "Договоры на абонентское обслуживание"
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АбонентскоеОбслуживаниеВидимостьЭлементов()
	
	//{{ Коробов П.В. "Договоры на абонентское обслуживание"
	ЭлементыВидно = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Элементы.ГруппаПериодДействияДоговора.Видимость = ЭлементыВидно;
	Элементы.АбонентскаяПлата.Видимость = ЭлементыВидно;
	Элементы.СтоимостьЧасаРаботы.Видимость = ЭлементыВидно;
	
	//}} Коробов П.В. "Договоры на абонентское обслуживание"
	
КонецПроцедуры

#КонецОбласти
