
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = НачалоДня(НачалоМесяца(Объект.Дата)); 
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Остатки = РегистрыНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(Объект.Дата);
	Если Остатки.Количество() = 0 Тогда
		Объект.Выплаты.Очистить();
		Возврат;
	КонецЕсли;
	
	Объект.Выплаты.Очистить();
	Для Каждого Строка Из Остатки Цикл
		НоваяСтрокаТЧ = Объект.Выплаты.Добавить();
		НоваяСтрокаТЧ.Сотрудник = Строка.Сотрудник;
		НоваяСтрокаТЧ.Сумма = Строка.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти