
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Дата = КонецМесяца(ТекущаяДатаСеанса());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = КонецМесяца(Объект.Дата); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Остатки = РегистрыНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	Если Остатки.Количество() = 0 Тогда
		Объект.Выплаты.Очистить();
		Возврат;
	КонецЕсли;
	
	Объект.Выплаты.Очистить();
	Для Каждого Строка Из Остатки Цикл
		НоваяСтрокаТЧ = Объект.Выплаты.Добавить();
		НоваяСтрокаТЧ.Сотрудник = Строка.Сотрудник;
		НоваяСтрокаТЧ.Сумма = Строка.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти