
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите период",, "Объект.Период");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗаполнитьНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере()
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
		"Обработки.ВКМ_МассовоеСозданиеАктов.ЗаполнитьДоговорыИРеализации", Объект.Период);
	
	Возврат ДлительнаяОперация;

КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ДоговорыИРеализации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Объект.ДоговорыИРеализации.Очистить();
		
		Для Каждого Строка Из ДоговорыИРеализации Цикл
			НоваяСтрокаТЧ = Объект.ДоговорыИРеализации.Добавить();
			НоваяСтрокаТЧ.Договор = Строка.Договор;
			НоваяСтрокаТЧ.Реализация = Строка.Реализация;
		КонецЦикла;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти